rottenpotatoes/app/controllers/movies_controller.rb

  def same_director
    @id= params[:id] #retrive movie ID from URI route
    @movie=Movie.find(@id) #look up movie by ID
    @list= @movie.director #list of movies is found by director
  #  @movies=Movie.same_director(@list)

    if (@list.nil? || @list.empty?)
      flash[:notice] = "'#{@movie.title}' has no director info"
      redirect_to movies_path and return
    else
      @movies=Movie.where(director: @list)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]